Обработки/Reports/_РейтингиБумагКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РейтингиБумагКлиентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиенты</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РейтинговыеАгентства</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьРейтингамиЭмитента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьРейтингамиОригинатора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьРейтингамиГаранта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РейтингиБумагКлиентов/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	// Параметры по умолчанию

	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Отчет.ДополнятьРейтингамиЭмитента		= Истина;	
	Отчет.ДополнятьРейтингамиОригинатора	= Истина;
	Отчет.ДополнятьРейтингамиГаранта		= Истина;
	
	Отчет.Клиенты.ТипЗначения				= Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица");
	Отчет.РейтинговыеАгентства.ТипЗначения	= Новый ОписаниеТипов("СправочникСсылка.РейтинговыеАгентства");
	
	// Доступность реквизитов и команд в зависимости от прав
	
	Элементы.Организация.Видимость			= РаботаСПользователями.ЭтоПолноправныйПользователь();
	Элементы.ОрганизацияНадпись.Видимость	= Не Элементы.Организация.Видимость;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьПредставлениеДополненияРейтингами();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ПриИзмененииРеквизитовОтчета(Элементы.Организация);
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПриИзмененииРеквизитовОтчета(Элементы.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнятьРейтингамиЭмитентаПриИзменении(Элемент)

	ОбновитьПредставлениеДополненияРейтингами();	
	
	ПриИзмененииРеквизитовОтчета(Элементы.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнятьРейтингамиОригинатораПриИзменении(Элемент)

	ОбновитьПредставлениеДополненияРейтингами();	
	
	ПриИзмененииРеквизитовОтчета(Элементы.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнятьРейтингамиГарантаПриИзменении(Элемент)

	ОбновитьПредставлениеДополненияРейтингами();	
	
	ПриИзмененииРеквизитовОтчета(Элементы.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеДополненияРейтингами()
	
	МассивДополнений = Новый Массив;
	
	Если Отчет.ДополнятьРейтингамиЭмитента		Тогда МассивДополнений.Добавить("эмитента"); КонецЕсли;	
	Если Отчет.ДополнятьРейтингамиОригинатора	Тогда МассивДополнений.Добавить("оригинатора"); КонецЕсли;	
	Если Отчет.ДополнятьРейтингамиГаранта		Тогда МассивДополнений.Добавить("гаранта"); КонецЕсли;	

	Элементы.ГруппаДополнятьРейтингами.Заголовок = "Дополнять рейтингами " + СтрСоединить(МассивДополнений, ", ");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитовОтчета(Элемент)

	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ДокументРезультат, "НЕАКТУАЛЬНОСТЬ");
		
КонецПроцедуры
